## 4.7 피봇테이블과 그룹분석

In [2]:
import numpy as np
import pandas as pd

## 피봇테이블

In [3]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1
#행에 도시를
#열에 연도를 놓고보면.. 한눈에 볼 수 있을텐데..

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [4]:
df1.pivot("도시", "연도", "인구")     #행 열 데이터

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [6]:
# set_index와 unstack 사용....... 교수님비추ㅋㅋ
df1.set_index(["도시", "연도"])[["인구"]].unstack()

           인구
연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [7]:
# 지역과 도시를 행인덱스로 쓰겠다......에러
df1.pivot(["지역", "도시"], "연도", "인구")

ValueError: Length of passed values is 8, index implies 2.

In [9]:
pd.__version__ #저번이 안맞아서 에러나는거구나 ㅠㅠㅠㅠ (주의: 판다스 버전 1.1 미만에서는 버그로 인해 동작하지 않는다.)
# 아나콘다가 다른패키지까지 고려해서 맞춰놓은 판다스버전인것이다...
# 그래서 판다스 얘만 갑자기 버전을 올리면 안됨 ㅠㅜㅜ
#  아나콘다프롬프트에서 conda create -n panda
#  가상환경이 만들어진다. y
#    맨끝 판다 부분이 (base)와 같다.
#  conda env list
#  conda deactivate
#  conda astivate panda  이 가상환경에서 돌리는것...
#  conda install jupyter notebook 주피터노트북도 설치해줘야하는거~ 
#  conda update pandas
# 인스톨을 먼저 하고 하려공 conda install pandas
#            판다스 버전 확인
# import pandas as pd
# pd.__version__     1.1.3깔리셨다~~
# vscode  외쪽하단에 누르면, 상단에 인터프리터 부분에서 콘다확인
# bye
# exit
#  vscode 재접속

'1.0.5'

# 다시 정리    \*****중요  
_ 엔지니어라면 가상환경 여러개만들고 바꾸고 할꺼니까~  
기본 가상환경-base 이다  
conda create -n panda             # 가상환경을 판다로 만들었다   
conda deactivate                  # 기존 베이스가상환경에서 나옴  
conda activate panda              # 가상환경을 판다로 변경  
conda install pandas              # 판다스설치  
conda install jupyter notebook    #쥬피터노트북설치  
주피터노트북에서 다시 피봇돌리면 돌아감  
vscode에서는? 왼쪽하단에 파이썬3.8.5판다:콘다 확인했는데- 또 안돌아감?ㅋㅋ
..이따 교수님이 알려주신다고~

프로그램데이터- 아나콘다3- env-파이썬.exe

## 그룹분석
groupby 메서드

In [10]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [11]:
groups = df2.groupby(df2.key1) #키1으로 A,b 그룹바이하겠다는뜻... 
groups  #이런객체이다 DataFrameGroupBy

In [12]:
groups.groups  #a행인덱스 0.1.4  / b행인덱스 2.3이있다. ...정도로만 알고넘어가자

{'A': Int64Index([0, 1, 4], dtype='int64'),
 'B': Int64Index([2, 3], dtype='int64')}

In [13]:
groups.sum()  #이렇게쓰면 헷갈리니까 아래처럼

      data1  data2
key1
A         8     80
B         7     70

In [14]:
df2.groupby(df2.key1).sum()  # 키1에 대해서 AB로 구분. 합계를 보여줌

      data1  data2
key1
A         8     80
B         7     70

In [16]:
df2.groupby(df2['key1']).sum()   #이렇게 써도 결과는 같다

      data1  data2
key1
A         8     80
B         7     70

In [17]:
# 데이터1만 보고싶다?
df2.groupby(df2.key1)['data1'].sum()   
#데이터프레임을 그룹으로 바꾸고, 보고싶은건 data1이야

key1
A    8
B    7
Name: data1, dtype: int64

In [22]:
#연습문제4.7.1  위와같은 내용인데 중첩하니까 시리즈가 아닌 데이터프레임으로 나왔다
#튜플로 하고싶음.. [['data1']] 이부분이 (data1, )
df2.groupby(df2.key1)[['data1']].sum()

      data1
key1
A         8
B         7

In [23]:
df2.groupby(df2.key1)[('data1',)].sum()    #이렇게 ...  같은결과인데왜이렇게 다양하게... 하는겨????????

      data1
key1
A         8
B         7

In [21]:
df2.groupby(df2.key1)[('data1','data2')].sum()  
# 데이터프레임 10개중 
# 2개만 꺼내고싶으면 튜플로 리스트로 [('data1','data2')

      data1  data2
key1
A         8     80
B         7     70

In [15]:
df2.groupby(df2.key1).mean()   # 키1에 대해서 평균mean

         data1      data2
key1
A     2.666667  26.666667
B     3.500000  35.000000

In [24]:
df2.data1.groupby([df2.key1, df2.key2]).sum() 
#같은결과1)df2.data1을 그룹바이를 먼저 했다.

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

In [25]:
df2.groupby([df2.key1, df2.key2])['data1'].sum() 
#같은결과2) 데이터프레임응ㄹ 전체적으로 그룹하고

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

In [ ]:
#같은결과3) 최종결과를 뽑뽑

## 붓꽃....

In [3]:
import seaborn as sns
iris = sns.load_dataset("iris")

In [4]:
def peak_to_peak_ratio(x):
    return x.max() / x.min()

iris.groupby(iris.species).agg(peak_to_peak_ratio)
#그룹바이하고 집계함수agg메서드 (함수명peak_to_peak_ratio)사용 _ 각품종별로 최대, 최소값의 비율이 나오게 됨
# 혼란스러운 코드
# 리스트에서 map함수 썻는데.. (리스트엘리먼트에대해서 각각 적용시키는)
# 그루핑한 애들한테 각각 .agg함수 적용된것임

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [5]:
#이렇게 해도되는데 왜 위에처럼 하는지 모르겠다고...
#mean이 없을때는 .agg(peak_to_peak_ratio) 이렇게 함수를 만들어서 적용
# 함수명: peak_to_peak_ratio
# .agg( 여기에 람다함수들어올수있어영~~~)
iris.groupby(iris.species).mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [8]:
# iris.groupby(iris.species).describe().T 전체안보고 
#아래처럼 ['sepal_length']만 볼게요~
#품목별로 기초통계량을 보여준다. 최소최대 사분위수 평균 표준편차 중앙값
# 결과값: 50개씩갯수/ 평균 / std표준/ 최소 /사분위 1,2,3/ 최대
iris.groupby(iris.species)['sepal_length'].describe()

            count   mean       std  min    25%  50%  75%  max
species
setosa       50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor   50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica    50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

1. 눈으로 확인하기  
head()  
tail()  
2. 기초통계량  (자꾸 봐서 눈에 익히기)  
구글링_ 앤스컴 콰르텟 (유명한 통계자료! 기초통계량이같은데 표로만들어보니 다름)

## apply 메서드를 사용하면 
## (데이터프레임을 따로 만들어내는것)_
## describe 메서드처럼 하나의 그룹에 대해 하나의 대표값(스칼라 값)을 구하는 게 아니라 데이터프레임을 만들 수 있다

In [12]:
# ascending=False)[:3]부분은 SQL문 desc limit 3와 같다
def top3_petal_length(df):
    return df.sort_values(by="petal_length", ascending=False)[:3]

iris.groupby(iris.species).apply(top3_petal_length)

                sepal_length  sepal_width  petal_length  petal_width  \
species
setosa     24            4.8          3.4           1.9          0.2
           44            5.1          3.8           1.9          0.4
           23            5.1          3.3           1.7          0.5
versicolor 83            6.0          2.7           5.1          1.6
           77            6.7          3.0           5.0          1.7
           72            6.3          2.5           4.9          1.5
virginica  118           7.7          2.6           6.9          2.3
           117           7.7          3.8           6.7          2.2
           122           7.7          2.8           6.7          2.0

                   species
species
setosa     24       setosa
           44       setosa
           23       setosa
versicolor 83   versicolor
           77   versicolor
           72   versicolor
virginica  118   virginica
           117   virginica
           122   virginica

## transform 메서드는 그룹별 대표값을 만드는 것이 아니라 
## 그룹별 계산을 통해 데이터프레임 자체를 변화시킨다. 
따라서 만들어진 데이터프레임의 크기는 원래 데이터프레임과 같다. 예를 들어 다음처럼 각 붓꽃 꽃잎길이가 해당 종 내에서 대/중/소 어느 것에 해당되는지에 대한 데이터프레임을 만들 수도 있다.

In [13]:
def q3cut(s):
    return pd.qcut(s, 3, labels=["소", "중", "대"]).astype(str)
##큐컷 평균 3개

#새 컬럼["petal_length_class"] 추가 transform(q3cut)
iris["petal_length_class"] = iris.groupby(iris.species).petal_length.transform(q3cut)
iris[["petal_length", "petal_length_class"]].tail(10)

NameError: name 'pd' is not defined